content/imported/tutorials/multiple-perpendicular-flaps/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Upstream-Centers
  {
    mesh              Fluid-Upstream-Mesh-Centers;
    patches           (flap1);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress-Upstream
    );
  };
  
  Upstream-Nodes
  {
    mesh              Fluid-Upstream-Mesh-Nodes;
    patches           (flap1);
    locations         faceNodes;
    
    readData
    (
      Displacement-Upstream
    );
    
    writeData
    (
    );
  };
  
  Downstream-Centers
  {
    mesh              Fluid-Downstream-Mesh-Centers;
    patches           (flap2);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress-Downstream
    );
  };
  
  Downstream-Nodes
  {
    mesh              Fluid-Downstream-Mesh-Nodes;
    patches           (flap2);
    locations         faceNodes;
    
    readData
    (
      Displacement-Downstream
    );
    
    writeData
    (
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}
